tutorials/fluidSolidInteraction/HronTurekFsi3.org/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    IQNILS;

IQNILSCoeffs
{
    solidPatch           plate;
    solidZone            plateZone;

    fluidPatch           plate;
    fluidZone            plateZone;

    relaxationFactor     0.05;

    interfaceDeformationLimit 0;

    // FSI loop tolerance
    outerCorrTolerance   1e-6;

    // FSI loop maximum number of correctors
    nOuterCorr           30;

    //interpolatorUpdateFrequency 0;

    //couplingReuse        0;

    // Enable/disable coupling
    coupled              no;

    // Enable coupling at specified time
    couplingStartTime    2.0;
}

// ************************************************************************* //
