tutorials/fluidSolidInteraction/HronTurekFsi3.org/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
}

gradSchemes
{
    default leastSquares;
}

divSchemes
{
    default none;
    div(phi,U)   Gauss linearUpwind cellLimited leastSquares 1;
}

laplacianSchemes
{
    default none;
    laplacian(nu,U) Gauss linear newSkewCorrected 1;
    laplacian((1|A(U)),p) Gauss linear newSkewCorrected 1;
    laplacian(diffusivity,cellMotionU) Gauss linear newSkewCorrected 1;
}

interpolationSchemes
{
    default linear;
    interpolate(U) skewCorrected linear;
}

snGradSchemes
{
    default newSkewCorrected 1;
}

fluxRequired
{
    default no;
    p;
}


// ************************************************************************* //
